

-- ■진행3. CRUD (SELECT Subquery 연습문제 14~25)
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-14
-- -- emp 테이블에서  부서번호가 30번인 사원들의 최소급여보다 더 적은 급여를 받는 사원을  조회하시오.
-- -- ※ ALL 연산자는 서브쿼리가 반환한 여러결과값 모든조건을 만족해야지  TRUE로 반환해주는 연산자
-- +-------+-------+-------+------+------------+------+------+--------+
-- | empno | ename | job   | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-------+------+------------+------+------+--------+
-- |  7369 | SMITH | CLERK | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- +-------+-------+-------+------+------------+------+------+--------+
-- 1 row in set (0.00 sec)
select *
from emp
where sal < all (select sal from emp where deptno = 30);

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-15
-- -- emp 테이블에서  부서번호가 30번인 사원들의 최대급여보다 더 많이 급여를 받는 사원을  조회하시오.
-- -- ※ ALL 연산자는 서브쿼리가 반환한 여러결과값 모든조건을 만족해야지  TRUE로 반환해주는 연산자
-- +-------+-------+-----------+------+------------+------+------+--------+
-- | empno | ename | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- |  7566 | JONES | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7788 | SCOTT | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7902 | FORD  | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7839 | KING  | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- 4 rows in set (0.00 sec)
select *
from emp
where sal > all (select sal from emp where deptno = 30)
order by sal;

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-16
-- -- emp 테이블에서  부서번호가 10인  부서명이 존재하다면  그부서의 사원데이터를  조회하시오.
-- -- ※  EXISTS 서브쿼리에 결과값이 하나이상 존재하면 조건식이 모두 TRUE , 존재하지 않으면 FALSE
-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 14 rows in set (0.00 sec)


-- SELECT *
--   FROM EMP
--  WHERE EXISTS (SELECT DNAME
--                  FROM DEPT
--                 WHERE DEPTNO = 10);


-- -- emp 테이블에서  부서번호가 10인  부서명이 존재하다면  그부서의 사원데이터를  조회하시오.
-- -- ※  EXISTS 서브쿼리에 결과값이 하나이상 존재하면 조건식이 모두 TRUE , 존재하지 않으면 FALSE
-- -- 부서명이 존재하므로 데이터를 출력할수 있음.

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-17
-- -- emp 테이블에서  부서번호가 50인  부서명이 존재하다면  그부서의 사원데이터를  조회하시오.
-- -- ※  EXISTS 서브쿼리에 결과값이 하나이상 존재하면 조건식이 모두 TRUE , 존재하지 않으면 FALSE
-- 선택된 행 없음

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-18
-- -- emp 테이블에서   부서별 부서번호와 최대급여가  같은사원을 조회하시오.
-- +-------+-------+-----------+------+------------+------+------+--------+
-- | empno | ename | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- |  7698 | BLAKE | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7788 | SCOTT | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING  | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7902 | FORD  | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- 4 rows in set (0.00 sec)



-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-19
-- -- emp ,DEPT 테이블에서  부서번호가 10인 사원의 정보와 부서의 정보를  조회하시오.
-- -- FROM 절에서 부서번호가 10인 사원정보를 구하는 인라인뷰(FROM절에 사용하는 서브쿼리)를 이용하세요.
-- +-------+--------+--------+------------+----------+
-- | empno | ename  | deptno | dname      | loc      |
-- +-------+--------+--------+------------+----------+
-- |  7782 | CLARK  |     10 | ACCOUNTING | NEW YORK |
-- |  7839 | KING   |     10 | ACCOUNTING | NEW YORK |
-- |  7934 | MILLER |     10 | ACCOUNTING | NEW YORK |
-- +-------+--------+--------+------------+----------+
-- 3 rows in set (0.00 sec)




-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-20
-- -- emp , SALGRADE 테이블에서  서브쿼리를 이용하여 다음과 같이 조회하시오
-- -- 열영역 안에서 사용하는 스칼라 쿼리
-- -- 힌트1. SALGRADE테이블엥서  최저급여와 최대급여 사이에 해당하는 급여의 등급
-- -- 힌트2. DEPT테이블에서  사원테이블의 부서번호와 부서테이블의 부서번호가 같은 부서이름
-- +-------+--------+-----------+------+----------+--------+------------+
-- | EMPNO | ENAME  | JOB       | SAL  | SALGRADE | DEPTNO | DNAME      |
-- +-------+--------+-----------+------+----------+--------+------------+
-- |  7369 | SMITH  | CLERK     |  800 |        1 |     20 | RESEARCH   |
-- |  7499 | ALLEN  | SALESMAN  | 1600 |        3 |     30 | SALES      |
-- |  7521 | WARD   | SALESMAN  | 1250 |        2 |     30 | SALES      |
-- |  7566 | JONES  | MANAGER   | 2975 |        4 |     20 | RESEARCH   |
-- |  7654 | MARTIN | SALESMAN  | 1250 |        2 |     30 | SALES      |
-- |  7698 | BLAKE  | MANAGER   | 2850 |        4 |     30 | SALES      |
-- |  7782 | CLARK  | MANAGER   | 2450 |        4 |     10 | ACCOUNTING |
-- |  7788 | SCOTT  | ANALYST   | 3000 |        4 |     20 | RESEARCH   |
-- |  7839 | KING   | PRESIDENT | 5000 |        5 |     10 | ACCOUNTING |
-- |  7844 | TURNER | SALESMAN  | 1500 |        3 |     30 | SALES      |
-- |  7876 | ADAMS  | CLERK     | 1100 |        1 |     20 | RESEARCH   |
-- |  7900 | JAMES  | CLERK     |  950 |        1 |     30 | SALES      |
-- |  7902 | FORD   | ANALYST   | 3000 |        4 |     20 | RESEARCH   |
-- |  7934 | MILLER | CLERK     | 1300 |        2 |     10 | ACCOUNTING |
-- +-------+--------+-----------+------+----------+--------+------------+
-- 14 rows in set (0.00 sec)





-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-21
-- -- emp ,DEPT 테이블에서  ALLEN과 같은 직책인  사원데이터를  다음과 같이  조회하시오.
-- +----------+-------+--------+------+--------+-------+
-- | JOB      | EMPNO | ENAME  | SAL  | DEPTNO | DNAME |
-- +----------+-------+--------+------+--------+-------+
-- | SALESMAN |  7844 | TURNER | 1500 |     30 | SALES |
-- | SALESMAN |  7654 | MARTIN | 1250 |     30 | SALES |
-- | SALESMAN |  7521 | WARD   | 1250 |     30 | SALES |
-- | SALESMAN |  7499 | ALLEN  | 1600 |     30 | SALES |
-- +----------+-------+--------+------+--------+-------+
-- 4 rows in set (0.00 sec)



-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-22
-- -- emp ,DEPT , SALGRADE테이블에서  평균 급여보다 많은 급여를 받는 사원들의 정보를  다음과 같이  조회하시오.
-- -- 급여가 많은순으로 정렬 만약에 같은 급여가 있다면 사원번호를 오른차순으로 정렬하시오.
-- +-------+-------+------------+------------+----------+------+-------+
-- | EMPNO | ENAME | DNAME      | HIREDATE   | LOC      | SAL  | GRADE |
-- +-------+-------+------------+------------+----------+------+-------+
-- |  7839 | KING  | ACCOUNTING | 1981-11-17 | NEW YORK | 5000 |     5 |
-- |  7788 | SCOTT | RESEARCH   | 1987-04-19 | DALLAS   | 3000 |     4 |
-- |  7902 | FORD  | RESEARCH   | 1981-12-03 | DALLAS   | 3000 |     4 |
-- |  7566 | JONES | RESEARCH   | 1981-04-02 | DALLAS   | 2975 |     4 |
-- |  7698 | BLAKE | SALES      | 1981-05-01 | CHICAGO  | 2850 |     4 |
-- |  7782 | CLARK | ACCOUNTING | 1981-06-09 | NEW YORK | 2450 |     4 |
-- +-------+-------+------------+------------+----------+------+-------+
-- 6 rows in set (0.00 sec)




-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-23
-- -- emp , DEPT테이블에서  10번부서에 근무하는 사원중
-- -- 30번 부서에는 존재하지 않는 직책을 가진 사원들의 정보를 다음과 같이  조회하시오.
-- +-------+-------+-----------+--------+------------+----------+
-- | EMPNO | ENAME | JOB       | DEPTNO | DNAME      | LOC      |
-- +-------+-------+-----------+--------+------------+----------+
-- |  7839 | KING  | PRESIDENT |     10 | ACCOUNTING | NEW YORK |
-- +-------+-------+-----------+--------+------------+----------+
-- 1 row in set (0.00 sec)




-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-24
-- -- emp , SALGRADE테이블에서
-- --직책이 SALESMAN 인 사람들의 최고 급여보다 높은 급여를  받는  사원들의 정보를 다음과 같이  조회하시오.
-- -- 다중행 함수 사용하지 않는 방법
-- +-------+-------+------+-------+
-- | EMPNO | ENAME | SAL  | GRADE |
-- +-------+-------+------+-------+
-- |  7566 | JONES | 2975 |     4 |
-- |  7698 | BLAKE | 2850 |     4 |
-- |  7782 | CLARK | 2450 |     4 |
-- |  7788 | SCOTT | 3000 |     4 |
-- |  7839 | KING  | 5000 |     5 |
-- |  7902 | FORD  | 3000 |     4 |
-- +-------+-------+------+-------+
-- 6 rows in set (0.00 sec)


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-25
-- -- emp , SALGRADE테이블에서
-- --직책이 SALESMAN 인 사람들의 최고 급여보다 높은 급여를  받는  사원들의 정보를 다음과 같이  조회하시오.
-- --다중행 함수 사용하는 방법
-- +-------+-------+------+-------+
-- | EMPNO | ENAME | SAL  | GRADE |
-- +-------+-------+------+-------+
-- |  7566 | JONES | 2975 |     4 |
-- |  7698 | BLAKE | 2850 |     4 |
-- |  7782 | CLARK | 2450 |     4 |
-- |  7788 | SCOTT | 3000 |     4 |
-- |  7839 | KING  | 5000 |     5 |
-- |  7902 | FORD  | 3000 |     4 |
-- +-------+-------+------+-------+
-- 6 rows in set (0.00 sec)



